---
kind: property
id: P:Autodesk.Revit.DB.Family.CurtainPanelVerticalSpacing
zh: 族
source: html/a739a1d1-b06e-d6f9-0c2c-da31b28568eb.htm
---
# Autodesk.Revit.DB.Family.CurtainPanelVerticalSpacing Property

**中文**: 族

For Curtain Panel families, the vertical spacing of the
driving mesh.

## Syntax (C#)
```csharp
public double CurtainPanelVerticalSpacing { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown if this family is not the owner family of a curtain panel family document.